[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
<S>
<T>
!
%
(
)
*
,
-
.
/
0
1
2
3
4
5
6
7
8
9
;
?
^
_
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
×
…
‼
→
★
☆
♪
❗
、
。
々
「
」
『
』
【
】
〜
ぁ
あ
い
う
え
お
か
き
く
け
こ
さ
し
す
せ
そ
た
ち
っ
つ
て
と
な
に
ぬ
ね
の
は
ひ
ふ
へ
ほ
ま
み
む
め
も
ゃ
や
ゆ
ょ
よ
ら
り
る
れ
ろ
わ
を
ん
ァ
ア
ィ
イ
ウ
ェ
エ
ォ
オ
カ
キ
ク
ケ
コ
サ
シ
ス
セ
ソ
タ
チ
ッ
ツ
テ
ト
ナ
ニ
ネ
ノ
ハ
ヒ
フ
ヘ
ホ
マ
ミ
ム
メ
モ
ャ
ヤ
ュ
ユ
ョ
ヨ
ラ
リ
ル
レ
ロ
ワ
ン
ヶ
・
ー
一
丁
万
丈
三
上
下
不
世
両
並
中
丸
主
久
乗
乳
乾
了
予
事
二
互
交
人
今
介
仕
他
付
代
以
件
会
伝
伸
似
位
低
体
何
余
作
使
例
供
価
便
係
保
信
修
個
倍
倒
値
側
傘
備
傷
働
像
優
元
充
先
光
入
全
公
共
具
内
円
再
写
冬
冷
凄
処
凹
出
刃
分
切
初
判
別
利
到
制
刷
刺
削
前
剤
剥
割
力
加
劣
助
労
効
勉
動
勝
勢
勤
勧
匂
包
化
十
半
単
印
危
即
厚
原
去
参
友
反
収
取
受
口
古
句
可
台
右
号
合
同
名
向
含
吸
吹
呂
告
周
味
命
和
品
商
問
善
喜
器
四
回
因
団
困
囲
図
固
国
土
圧
在
地
均
型
基
報
場
塗
境
増
壁
壊
声
売
変
夏
外
多
夜
大
天
太
夫
失
奥
女
好
妙
始
娘
嫌
嬉
子
字
存
学
宅
守
安
完
定
宝
実
室
害
家
容
寄
密
寒
寝
寧
対
封
専
射
小
少
局
届
屋
属
履
山
工
左
差
巻
布
希
帯
帰
常
幅
干
平
年
広
床
底
店
度
座
庫
庭
延
式
引
弱
張
強
当
形
影
役
彼
待
後
得
復
微
心
必
忘
応
快
念
怖
思
急
性
怪
恐
息
悔
悩
悪
情
想
意
愛
感
態
慢
慣
成
我
戦
戻
所
手
打
扱
技
投
折
抜
択
押
担
拭
持
指
挟
振
挿
捨
掃
掛
探
接
描
換
損
携
撃
撮
操
擦
支
改
放
故
敗
教
散
数
整
敵
敷
文
料
斜
断
新
方
旅
族
日
早
明
易
昔
星
映
時
普
晴
晶
暑
暖
暗
曲
更
書
替
最
月
有
服
望
朝
期
木
未
末
本
材
来
板
枚
果
柄
染
柔
根
格
案
梱
検
業
極
楽
構
様
横
機
欠
次
欲
欺
止
正
歩
歪
歯
歳
残
段
母
毎
比
毛
気
水
求
汗
汚
池
決
沢
油
治
況
法
泡
波
注
洗
活
流
浄
浮
海
消
液
深
混
清
済
渉
減
温
測
湯
湿
満
源
準
溶
滅
滑
漏
演
潰
激
濃
濡
濯
火
灯
点
為
無
然
焼
照
熱
燥
爪
片
版
物
特
犬
状
狭
猫
率
玉
現
球
理
環
甘
生
産
用
由
申
男
画
界
留
番
異
畳
疑
疲
症
痛
発
登
白
的
皆
皮
盤
目
直
相
真
眠
眼
着
瞬
知
短
石
破
硬
確
磁
磨
示
社
私
秒
移
程
種
穴
空
突
立
端
笑
第
筆
等
筋
答
策
箇
管
箱
節
範
簡
米
粉
粒
粗
粘
精
糸
系
約
紋
納
紐
純
紙
級
素
細
終
組
経
結
絡
給
絵
絶
継
続
綺
総
緒
線
締
編
緩
練
縁
縦
縫
縮
繋
繰
置
美
群
羽
翌
習
考
者
耐
耗
耳
聞
聴
肉
肌
肝
肩
背
能
脂
脚
脱
腕
腰
腹
膨
自
臭
致
興
般
良
色
花
若
苦
英
茶
荒
荷
華
落
葉
蓋
蔵
薄
薬
血
行
衝
表
袋
被
装
裏
裕
補
製
複
要
見
規
視
覚
親
観
角
解
触
言
計
討
記
設
許
訳
証
詐
評
試
詰
話
詳
認
語
誤
説
読
誰
調
論
諦
識
護
象
負
財
販
買
費
貼
賞
質
購
赤
走
起
超
足
距
跡
躍
身
車
転
軽
較
載
輪
辛
辺
込
迅
近
返
迷
追
送
逆
透
途
通
速
造
連
週
進
遅
遊
運
過
道
達
違
遠
適
選
邪
部
配
酷
酸
重
野
量
金
針
釣
銭
錆
録
鏡
長
閉
開
間
関
防
降
限
除
険
階
隙
際
障
隠
集
雑
離
難
雨
電
青
静
非
面
革
靴
音
響
頂
頃
頑
頭
頻
頼
題
額
顔
願
類
風
飛
食
飲
首
香
駄
験
騙
驚
骨
高
髪
魅
魔
鳴
麗
黄
黒
鼻
！
（
）
，
．
０
１
２
３
４
５
６
８
：
？
ｃ
ｄ
ｍ
ｗ
～
･
